---
type: RoomTag
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 6
tags: [revit-api, class]
---

# RoomTag

`Autodesk.Revit.DB.Architecture.RoomTag` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | IsInRoom | 2017 | `public bool IsInRoom { get ; }` |
| Property | Parameter | — | `` |
| Property | Room | — | `public Room Room { get ; }` |
| Property | RoomTagType | — | `public RoomTagType RoomTagType { get ; set ; }` |
| Property | TaggedLocalRoomId | 2017 | `public ElementId TaggedLocalRoomId { get ; }` |
| Property | TaggedRoomId | 2017 | `public LinkElementId TaggedRoomId { get ; }` |